<template>
    <div class="about-platform-container">
        <span class="bold-span">О платформе</span>
        <div>
            <div @click="showOrHideFirstInfo()">
                <span v-if="!firstInfoShown" class="bold-span">+</span>
                <span v-if="firstInfoShown" class="bold-span">-</span>
                <span class="bold-span">О платформе EFFOR.BY</span>
            </div>
            <transition name="slide-fade">
                <div v-if="firstInfoShown" class="first-info-container">
                    <p><span class="bold-span">Учебно-соревновательная платформа EFFOR.BY</span> – это комплекс информационных ресурсов и сервисов, мобильных приложений и методика их использования для мотивации и обучения современных школьников.</p>
                    <p><span class="bold-span">Пользователи EFFOR.BY</span></p>
                    <p><span class="bold-span">Школьники</span> – выполняют проверочные работы, проходят учебные и развивающие онлайн курсы, выявляют и устраняют пробелы в знаниях, участвуют в интеллектуальных соревнованиях.</p>
                    <p><span class="bold-span">Родители</span> – мотивируют своих детей, осуществляют контроль их работы на сайте, за ходом и результатами обучения.</p>
                    <p><span class="bold-span">Учителя</span> – готовятся к урокам, получают презентации, раздаточные материалы, проводят обучение с помощью компьютеров и планшетов в школе, помогают ученикам организовать самостоятельную работу дома.</p>
                    <p><span class="bold-span">Школы-партнеры</span> – внедряют платформу <span class="bold-span">EFFOR.BY</span> и сопутствующие технические решения в учебный процесс, оказывают с их помощью платные образовательные услуги.</p>
                </div>
            </transition>
        </div>
        <div>
            <div @click="showOrHideSecondInfo()">
                <span v-if="!secondInfoShown" class="bold-span">+</span>
                <span v-if="secondInfoShown" class="bold-span">-</span>
                <span class="bold-span">Проект «Мобильный смарт-марафон»</span>
            </div>
            <transition name="slide-fade">
                <div v-if="secondInfoShown" class="second-info-container">
                    <p>Соревнования МСМ:</p>
                    <ul>
                        <li>могут быть учебного и развивающего характера;</li>
                        <li>проводятся на смартфонах, планшетах или компьютерах учащихся.</li>
                    </ul>
                    <p>Каждую субботу проходит новый тур МСМ. В каждом туре все школы региона разбиваются на игровые пары. Игры между всеми школами проходят в одно время.</p>
                    <p>В каждой игре от школы принимают участие 7 команд (по одной команде от каждой параллели 4-10 классов). Число игроков в командах не ограничивается, но в зачет для каждой школы идут 5 лучших результатов от параллели.</p>
                    <p>Каждая игра состоит из 7 турниров. В первом турнире соревнуются команды 4 классов, во втором – 5 классов, …, в седьмом турнире – 10 классов.</p>
                    <p>Время запуска турнирных заданий:</p>
                    <p>для 4-х классов с 11-00 до 11-05;</p>
                    <p>для 5-х классов с 11-15 до 11-20;</p>
                    <p>для 6-х классов с 11-30 до 11-35;</p>
                    <p>для 7-х классов с 11-45 до 11-50;</p>
                    <p>для 8-х классов с 12-00 до 12-05;</p>
                    <p>для 9-х классов с 12-15 до 12-20;</p>
                    <p>для 10-х классов с 12-30 до 12-35.</p>
                    <p>В каждом турнире подсчитываются набранные школами очки. Напомним, от каждой школы в зачет идут 5 лучших результатов учащихся. За 1 место школа получает 10 баллов, за 2 место – 9 баллов, за 3 место – 8 баллов, …, за 10 место – 1 балл. По сумме баллов определяется победитель турнира. За победу в турнире школа получает одно очко. При равенстве баллов в турнире объявляется ничья, по очку получает каждая школа.</p>
                    <p>Победителем в игровой паре считается та школа, которая набрала больше очков. При равенстве очков победителем считается та школа, которая в сумме набрала больше баллов во всех турнирах. Победитель в игровой паре за каждый тур получает два очка.</p>
                    <p>МСМ проводится в три этапа:</p>
                    <ul>
                        <li>подготовительный этап: регистрация всех участников смарт-марафона, проведение пробных игр;</li>
                        <li>отборочные игры: турниры проводятся заочно (каждая школа играет на своей территории);</li>
                        <li>финальные игры: между 16 школами региона, набравшими максимальное число рейтинговых баллов, турниры проводятся в очном формате.</li>
                    </ul>
                    <p>В отборочных турах игроки (школьники) могут принимать участие в турнире как в школе (например, в компьютерном классе), так и дома.</p>
                    <p>На финальные игры все игроки приходят со своими смартфонами на заранее оговоренную игровую площадку и выполняют задания турнира в присутствии наблюдателей.</p>
                </div>
            </transition>
        </div>
        <div>
            <div @click="showOrHideThirdInfo()">
                <span v-if="!thirdInfoShown" class="bold-span">+</span>
                <span v-if="thirdInfoShown" class="bold-span">-</span>
                <span class="bold-span">О платформе EFFOR.BY</span>
            </div>
            <transition name="slide-fade">
                <div v-if="thirdInfoShown" class="third-info-container">
                    <p>Более подробную информацию по проекту «Мобильный смарт-марафон» Вы можете получить, скачав:</p>
                    <p><a href="/dist/header.docx" download="header">Памятка руководителю;</a></p>
                    <p><a href="/dist/teacher.docx" download="teacher">Памятка учителю;</a></p>
                    <p><a href="/dist/pupil.docx" download="pupil">Памятка ученику;</a></p>
                </div>
            </transition>
        </div>
        <div>
            <div @click="showOrHideForthInfo()">
                <span v-if="!forthInfoShown" class="bold-span">+</span>
                <span v-if="forthInfoShown" class="bold-span">-</span>
                <span class="bold-span">Подведение итогов и награждение победителей смарт-марафона 2016-2017</span>
            </div>
            <transition name="slide-fade">
                <div v-if="forthInfoShown" class="forth-info-container">
                    <p>25 октября 2017 года на базе ГУО «Средняя школа № 181 г. Минска» состоялась торжественная церемония награждения победителей городского образовательного онлайн-чемпионата «Мобильный смарт-марафон».</p>
                    <p>В онлайн-чемпионате приняли участие команды учащихся пятых, шестых, седьмых и восьмых классов из 26 учреждений образования города Минска в турнирах тематических проектов «Свет анаграм», «Пишем грамотно», «Основы устного счета» и «Мая родная мова».</p>
                    <p>Участники команд проявили себя в упорной борьбе в игровых состязаниях четвертьфинальных, полуфинальных и финальных играх.</p>
                    <p>В церемонии награждения приняли участие учащиеся 5-8 классов, педагогические работники – руководители команд учреждений образования г. Минска, сотрудники Минского городского института развития образования, ООО «Интеллект-онлайн».</p>
                    <p>Победители онлайн-чемпионата награждены дипломами I, II и III степени Минского городского института развития образования. Лучшие учреждения образования получили памятные призы.</p>
                    <p>Поздравляем победителей городского образовательного онлайн-чемпионата «Мобильный смарт-марафон»!</p>
                    <p><a href="http://iso.minsk.edu.by/ru/main.aspx?guid=27753" target="_blank">Подробнее на сайте центра информационных ресурсов системы регионального образования ГУО «Минский городской институт развития образования».</a></p>
                </div>
            </transition>
        </div>
        <div>
            <div @click="showOrHideFifthInfo()">
                <span v-if="!fifthInfoShown" class="bold-span">+</span>
                <span v-if="fifthInfoShown" class="bold-span">-</span>
                <span class="bold-span">Электронный образовательный контент</span>
            </div>
            <transition name="slide-fade">
                <div v-if="fifthInfoShown" class="fifth-info-container">
                    <p>Для образовательной платформы <span class="bold-span">EFFOR.BY</span> разработаны базы знаний по основным предметным областям:</p>
                    <p class="bold-span">русский язык;</p>
                    <p class="bold-span">белорусский язык;</p>
                    <p class="bold-span">математика;</p>
                    <p class="bold-span">информатика;</p>
                    <p class="bold-span">физика;</p>
                    <p class="bold-span">астрономия;</p>
                    <p class="bold-span">химия;</p>
                    <p class="bold-span">развитие способностей.</p>
                    <p>Предметные базы знаний <span class="bold-span">EFFOR.BY</span> можно сравнить с конструктором LEGO.</p>
                    <p>Из базы заданий по предметам мы компонуем курсы для поддержки разных учебных программ, учебников и учебных пособий.</p>
                    <p>Практически все учебные задания из предметных баз знаний сопровождаются подсказками, образцами решения, справочными материалами. Это значительно упрощает самостоятельную работу школьников с нашими онлайн курсами.</p>
                </div>
            </transition>
        </div>
        <div>
            <div @click="showOrHideSixthInfo()">
                <span v-if="!sixthInfoShown" class="bold-span">+</span>
                <span v-if="sixthInfoShown" class="bold-span">-</span>
                <span class="bold-span">Технология онлайн-обучения</span>
            </div>
            <transition name="slide-fade">
                <div v-if="sixthInfoShown" class="sixth-info-container">
                    <p>Важной частью платформы является методика использования, которая, в свою очередь, основана на технологии выявления и устранения пробелов в знаниях школьников.</p>
                    <p>Рассмотрим проблемы и перспективы использования данной технологии в образовательной практике.</p>
                    <p>В мире существуют две основные модели организации учебного процесса в школе:</p>
                    <ul>
                        <li>пока не усвоишь материал – дальше не двигаешься;</li>
                        <li>время пришло – все переходят к новому материалу.</li>
                    </ul>
                    <p>Большинство стран мира, в том числе все страны СНГ, строят школьное образование по второй модели.</p>
                    <p>Это означает, что: <span class="bold-span">разные</span> ученики <span class="bold-span">за одинаковое</span> время проходят <span class="bold-span">один и тот же</span> учебный материал. И из этого возникает неизбежная проблема: <span class="bold-span">у учеников накапливаются пробелы в знаниях</span>, у кого – больше, у кого – меньше.</p>
                    <p>Учителям сложно организовать устранение пробелов в знаниях на уроке. Самостоятельно дома у школьников это также не получается. На определенном этапе родители вынуждены решать проблему самостоятельно единственным, доступным для них способом – они нанимают репетитора.</p>
                    <p>Именно здесь, на наш взгляд, кроется основной, пока еще нераскрытый потенциал использования ИКТ в учебном процессе. Именно на этом пути можно рассчитывать выйти на реальное повышение качества обучения. Одним из инструментов должна стать платформа <span class="bold-span">EFFOR.BY</span> и лежащая в ее основе технология выявления и устранения пробелов в знаниях.</p>
                    <p>Сразу отметим, что системный результат возможен только при системном применении ИКТ. Даже в хорошо оснащенных школах постоянный доступ учителей и учащихся к компьютерам ограничен. Если ограничиваться только компьютерными ресурсами школы, реального повышения качества знаний ожидать сложно.</p>
                    <p>Поэтому наилучший и практически единственный выход – <span class="bold-span">вовлечение в учебный процесс домашних компьютеров и личных мобильных устройств учащихся</span>. Только в этом случае дело не остановится только на оценочном контроле усвоения материала. Только в этом случае можно организовать эффективный компьютерный обучающий тренинг.</p>
                    <p class="bold-span">Компьютерный тренинг должен выполняться:</p>
                    <ul>
                        <li>с учетом выявленных пробелов в знаниях (на основе предварительной диагностики);</li>
                        <li>до перевода знаний и умений в краткосрочную память (то есть, достаточное время);</li>
                        <li>на приемлемой скорости работы (для умений, требующих автоматического выполнения);</li>
                        <li>в первую очередь, на самом важном учебном материале.</li>
                    </ul>
                    <p>Еще одним важным аспектом технологии является то, что она позволяет организовать работу школьника в зоне ближайшего развития. Правильный подбор учебных заданий позволит сформировать для школьника посильную, но требующую определенных усилий индивидуальную программу обучения.</p>
                    <p>Все это учитывалось при разработке учебно-соревновательной платформы <span class="bold-span">EFFOR.BY.</span></p>
                </div>
            </transition>
        </div>
        <div>
            <div @click="showOrHideSeventhInfo()">
                <span v-if="!seventhInfoShown" class="bold-span">+</span>
                <span v-if="seventhInfoShown" class="bold-span">-</span>
                <span class="bold-span">Соревновательная интеллектуальная среда</span>
            </div>
            <transition name="slide-fade">
                <div v-if="seventhInfoShown" class="seventh-info-container">
                    <p>Мы придаем особое значение мотивации школьников. На наш взгляд, правильная мотивация является основой хорошей учебы. Но мотивировать школьника к хорошей учебе очень сложно. В первую очередь это задача родителей ребенка.</p>
                    <p>Еще одним важным фактором правильной мотивации современных школьников может стать соревновательная интеллектуальная среда, внедренная в систему образования. В результате должна формироваться такая атмосфера среди школьников, когда они будут гордиться своими знаниями. Будут стремиться развивать свой интеллект, станут настойчивыми в достижении учебных целей, научатся проявлять свои знания и интеллектуальные способности в сложных, экстремальных ситуациях.</p>
                    <p>Как же подойти к созданию такой среды?</p>
                    <p>Во-первых, нужна понятная и близкая школьникам содержательная концепция. Убедить их в том, что уважения достоин тот, кто великолепно знает всю школьную программу – невозможно. Они прагматики и интуитивно понимают, что значительная часть школьных знаний им в дальнейшей жизни не понадобится. И как максималисты – переносят негативное отношение на все школьные знания. Именно поэтому в последние десятилетия постепенно негативное отношение к «зубрилам» (тем, кто слишком много учит) трансформировалось в негативное отношение к «ботаникам» (тем, кто слишком много знает).</p>
                    <p>Поэтому концепция должна быть другой. Возможно, такой: уважения достоин тот школьник, который</p>
                    <p>а) знает, чего он хочет в жизни,</p>
                    <p>б) знает, что для этого нужно,</p>
                    <p>с) все нужное знает и умеет хорошо.</p>
                    <p>о есть, нужно направить прагматизм и максимализм современных школьников в правильное русло. По сути, это концепция комплексной, глубокой и ранней профориентации. Скорее всего, она должна дополнять, а не замещать традиционную концепцию «нужно одинаково хорошо знать все, чему учат в школе». Причем глашатаем такой концепции должны выступать и система образования, и окружающий ее социум, и национальный бизнес. Только тогда она станет убедительна и приемлема для массового школьника.</p>
                    <p>Во-вторых, нужна интересная и близкая школьникам организационная форма. Она должна носить соревновательный характер, активно использовать любимые современными школьниками компьютерные технологии. Такой формой могли бы стать массовые интеллектуальные онлайн-соревнования в сети Интернет. В первую очередь, учебного, развивающего и познавательного характера.</p>
                    <p>Эти идеи легли в основу проекта по развитию интеллектуальных онлайн-соревнований в рамках платформы <span class="bold-span">EFFOR.BY.</span></p>
                </div>
            </transition>
        </div>
        <div>
            <div @click="showOrHideEighthInfo()">
                <span v-if="!eighthInfoShown" class="bold-span">+</span>
                <span v-if="eighthInfoShown" class="bold-span">-</span>
                <span class="bold-span">Отзывы о платформе EFFOR.BY</span>
            </div>
            <transition name="slide-fade">
                <div v-if="eighthInfoShown" class="eighth-info-container">
                    <p>В опросе участвовало более двадцати учреждений образования из г. Барановичи.</p>
                    <p>Перечень вопросов, которые были предложены учреждениям образования.</p>
                    <ul>
                        <li>Считаете ли Вы использование электронных систем в образовательном процессе эффективным средством обучения?</li>
                        <li>Эффективно ли, на Ваш взгляд, Вы использовали <span class="bold-span">EFFOR</span> в рамках своего учреждения?</li>
                        <li>Анализировали ли Вы уровень повышения качества обучения с использованием <span class="bold-span">EFFOR</span>. Каковы результаты?</li>
                        <li>Что оказалось проблемным в работе с данной платформой (субъективные и объективные факторы)?</li>
                        <li>Намерены ли Вы дальше использовать данную платформу?</li>
                    </ul>
                    <p>Ниже приведены выдержки из отзывов учреждений образования.</p>
                    <p class="bold-span">Из отзыва Гимназии № 1</p>
                    <p>Анализ успеваемости показал, что <span class="bold-span">уровень качества обучения повысился у учащихся</span>, которые работали в <span class="bold-span">EFFOR</span> регулярно и целенаправленно. Все учителя отмечают, что с использованием упражнений в программе <span class="bold-span">EFFOR</span> повысилась успеваемость учащихся по предмету (от 50 до 85% учащихся улучшили отметки и повысили средний балл.)</p>
                    <p class="bold-span">Из отзыва гимназии № 2</p>
                    <p>Образовательная платформа дает возможность использовать организационные формы дистанционных (онлайн) групповых и индивидуальных занятий и консультаций, иных мероприятий в данном формате;</p>
                    <p class="bold-span">Из отзыва гимназии № 3</p>
                    <p>Повышает самооценку у детей, детям с заниженной самооценкой (неуверенных в себе) помогает реализовать свои возможности.</p>
                    <p class="bold-span">Из отзыва гимназии № 4</p>
                    <p>Учителя математики, физики, русского языка отмечают повышение уровня знаний учащихся с низким и средним уровнем обученности.</p>
                    <p class="bold-span">Из отзыва гимназии № 5</p>
                    <p>Учителя начальных классов предлагали учащимся задания для выполнения в домашних условиях под контролем родителей, а также в рамках факультативных занятий и дополнительных уроков (платные образовательные услуги по подготовке к поступлению в 5 класс гимназии). За время работы с сервисами <span class="bold-span">EFFOR.BY</span> в рамках отдельных учебных тем по русскому и белорусскому языкам и математике в параллели 4-х классов <span class="bold-span">процент качества знаний повысился до уровня 85-94%</span>. Также стоит отметить, что обогатился словарный запас учащихся по белорусскому языку. По учебной параллели 3-х классов с учетом регулярных занятий (в том числе и в домашних условиях) улучшились результаты вычислительных навыков по математике (процент качества знаний достиг 90).</p>
                    <p class="bold-span">Из отзыва лицея № 1</p>
                    <p>В ГУО «Лицей № 1 г. Барановичи» проводился анализ повышения качества обучения с использованием платформы <span class="bold-span">EFFOR</span>. Анализ показал, что <span class="bold-span">уровень качества знаний учащихся вырос на 5%.</span></p>
                    <p class="bold-span">Из отзыва СШ № 3</p>
                    <p>Постоянная работа на платформе <span class="bold-span">EFFOR</span> по математике была организована с 09.11.2015г. Это позволило повысить результат учебной деятельности по предмету «Математика». Самыми активными оказались семиклассники. На примере 7 «Б» класса продемонстрируем результаты работы. Анализ качества знаний проводился в конце 2 четверти на конец учебного года. Надо отметить, что 5 учащихся повысили отметку за 2 четверть на 2 балла и 8 учащихся – на 1 балл. В результате средний балл за 2 четверть повысился на 0,9 балла (с 5,5 до 6,4). Мониторинг годовых отметок показал повышение отметок за год на 2 балла у 2 учащихся и на 1 балл у 10. <span class="bold-span">Средний балл повысился на 0,7 (с 5,5 до 6,2).</span></p>
                    <p class="bold-span">Из отзыва СШ № 4</p>
                    <p>Да, мы анализировали уровень качества обучения с использованием <span class="bold-span">EFFOR</span>. ВСЕ учащиеся - активные пользователи <span class="bold-span">EFFOR - повысили свои отметки до 4-5 уровня!</span> Из наших наблюдений: когда учащиеся допускают ошибки в письменной самостоятельной работе - они смиряются с плохой отметкой, не стремятся ликвидировать пробелы в знаниях. При работе с <span>EFFOR</span> – учащиеся стремятся тут же найти правильный ответ на вопрос.</p>
                    <p class="bold-span">Из отзыва СШ № 7</p>
                    <p>Работа на площадке <span class="bold-span">EFFOR</span> создает условия для максимального учета индивидуальных образовательных возможностей и запросов учащихся, широкого выбора содержания, форм, темпа и уровня подготовки учащихся.</p>
                    <p class="bold-span">Из отзыва СШ № 10</p>
                    <p>Анализ работы, с использованием платформы, проведенный на заседаниях МО, свидетельствует о том, что появилась возможность закрепить пройденный учебный материал, устранить пробелы в знаниях, работать с учащимися высокомотивированными и слабомотивированными.</p>
                    <p class="bold-span">Из отзыва СШ № 12</p>
                    <p>Небольшой процент прохождения курсов по предметам не позволяет пока объективно провести мониторинг повышения качества обучения, но анализ работы в этом направлении свидетельствует о росте заинтересованности работой в данном направлении среди учителей и учащихся. Кроме этого нельзя не отметить, что трое учащихся 4 класса нашей школы являются победителями турниров «Считай страна» и «Пиши страна».</p>
                    <p class="bold-span">Из отзыва СШ № 13</p>
                    <p>Согласно оценочных листов, заполняемых педагогами по итогам четверти, средний <span class="bold-span">рост уровня учебных достижений учащихся составил 10,6%</span>. Рост уровня достижений учащихся определялся в сравнении с четвертными отметками и отметками за контрольные работы.</p>
                    <p class="bold-span">Из отзыва СШ № 14</p>
                    <p>Все упражнения - тесты, которые имеются на сайте <span class="bold-span">EFFOR.BY</span>, можно превратить в версию для печати. С помощью этого инструмента учитель может <span class="bold-span">быстро подготовить к уроку раздаточный материал.</span></p>
                    <p class="bold-span">Из отзыва СШ № 15</p>
                    <p>Анализ использования платформы <span class="bold-span">EFFOR</span> показал положительную динамику в развитии мотивационной сферы учащихся, повышения качества усвоения предметных знаний.</p>
                    <p class="bold-span">Из отзыва СШ № 16</p>
                    <p>Занятия в 3-8 классах были направлены на коррекцию пробелов в знаниях по отдельным темам. В 9-11 классах программа использовалась для подготовки к экзаменам и ЦТ. Анализ уровня повышения качества обучения с использованием <span class="bold-span">EFFOR</span> успеваемость учащихся по математике, русскому языку, белорусскому языку, физике повысилась по отдельным темам учебных программ, как у учащихся с низким уровнем успеваемости, так и у учащихся с повышенным уровнем успеваемости.</p>
                    <p class="bold-span">Из отзыва СШ № 17</p>
                    <p>Использование платформы <span class="bold-span">EFFOR</span> на наш взгляд является эффективным средством обучения, так как данный продукт позволяет:</p>
                    <ul>
                        <li>диагностировать и корректировать знания учащихся;</li>
                        <li>осуществить индивидуальный и дифференцированный подход в обучении (каждый учащийся имеет возможность работать в своем рабочем ритме, свой объем заданий);</li>
                        <li>повторять пройденный материал и работать на перспективу;</li>
                        <li>использовать ресурсы платформы для подготовки и проведения учителями учебных, факультативных занятий, подготовки к централизованному тестированию.</li>
                    </ul>
                    <p class="bold-span">Из отзыва СШ № 18</p>
                    <p>Педагогам нравится создавать свои проверочные работы, устанавливать сроки сдачи работ, но хотелось бы иметь возможность включать в эти работы какие-то свои задания, кроме этого дать возможность выполнить задания не только с первой попытки, но и со второй, и с третьей.</p>
                    <p class="bold-span">Из отзыва СШ № 19</p>
                    <p>Каждый современный образованный человек, тем более педагог, должен владеть умениями и навыками работы на компьютере, т. е. быть информационно компетентным. Использование в образовательном процессе компьютера – это не просто изменение технической вооруженности труда педагога, это обновление его роли, его готовность передавать свои знания и опыт новыми средствами. Наше учреждение образования в последние годы уделяет пристальное внимание совершенствованию образовательного процесса на основе внедрения средств информационно-коммуникационных технологий. Одно из направлений - использование в образовательном процессе платформы <span class="bold-span">EFFOR</span>, которая позволяет:</p>
                    <ul>
                        <li>корректировать пробелы в знаниях;</li>
                        <li>позволяет учащимся, которые пропустили занятия, отработать пропущенные темы;</li>
                        <li>позволяет учителю организовать дифференцированное обучение на уроке;</li>
                        <li>облегчает проверку знаний по отдельным темам;</li>
                        <li>повышает интерес учащихся к предмету.</li>
                    </ul>
                    <p class="bold-span">Из отзыва СШ № 20</p>
                    <p>Считаем, что использование образовательной платформы <span class="bold-span">EFFOR</span> является эффективным средством обучения. Данная платформа помогает повысить мотивацию учащихся к обучению, осуществить дифференцированный подход, стимулировать и повышать интерес к предмету. Использование электронных систем в образовательном процессе позволяет учащимся сразу видеть результат своей работы, корректировать пробелы в знаниях, этим самым, повышать качество обучения. Платформу <span class="bold-span">EFFOR</span> педагоги могут использовать при подготовке к урокам.</p>
                    <p class="bold-span">Из отзыва СШ № 21</p>
                    <ul>
                        <li>Удобно использовать на этапе закрепления знаний (как на уроке, так и дома), при контроле знаний на уроках;</li>
                        <li>высокая скорость выполнения заданий и отметка, которую ученик видит за что получил, ошибки;</li>
                        <li>сразу имеется возможность проведения коррекции знаний учителем по конкретной теме;</li>
                        <li>самопроверка знаний с мгновенным результатом.</li>
                    </ul>
                    <p>Так же по результатам опроса все учреждения образования, участвовавшие в опросе, изъявили желание продолжить работу с учебно-соревновательной платформой <span class="bold-span">EFFOR.BY.</span></p>
                    <div>
                        <p class="bold-span">Разработчики благодарны всем, кто высказал свое мнение о платформе EFFOR.BY.</p>
                        <p>Мы постоянно работаем над улучшением сервисов и исправлением ошибок в системе.</p>
                    </div>
                </div>
            </transition>
        </div>
        <div>
            <div @click="showOrHideNinethInfo()">
                <span v-if="!ninethInfoShown" class="bold-span">+</span>
                <span v-if="ninethInfoShown" class="bold-span">-</span>
                <span class="bold-span">Правила работы с сайтами</span>
            </div>
            <transition name="slide-fade">
                <div v-if="ninethInfoShown" class="nineth-info-container">
                    <p class="bold-span">Общие положения</p>
                    <p>1. Администрация Интернет-ресурсов NEW.EFFOR.BY и MSM.EFFOR.BY (далее – Портал) определяет правила поведения на нем и оставляет за собой право требовать их выполнения от посетителей.</p>
                    <p>2. Данные правила распространяются на всех посетителей Портала (как настоящих, так и будущих).</p>
                    <p>3. Незнание правил не освобождает от необходимости их выполнения. Пользуясь материалами Портала, Вы выражаете свое согласие с данными правилами и с необходимостью их соблюдения.</p>
                    <p>4. Общество с ограниченной ответственностью "Интеллект Онлайн" (далее – Компания) сохраняет за собой право изменять данные правила по своему усмотрению, без каких-либо предварительных уведомлений.</p>
                    <p>1. Регистрационные данные, безопасность аккаунта Регистрируясь на Портале (регистрируя свой аккаунт) и пользуясь Порталом, Вы обязуетесь:</p>
                    <p>1.1. Представить при регистрации точную, актуальную и полную информацию о Вас, которая может быть запрошена от Вас регистрационными формами Портала.</p>
                    <p>1.2. Принимать надлежащие меры для обеспечения сохранности Вашего имени пользователя, пароля и адреса электронной почты.</p>
                    <p>1.3. Периодически обновлять регистрационные данные и другую личную информацию, которую Вы предоставили при регистрации, чтобы обеспечить ее точность, актуальность и полноту.</p>
                    <p>1.4. Нести полную ответственность за любые действия, совершенные Вами с использованием Вашего аккаунта, а также за любые последствия, которые могут повлечь или повлекло подобное его использование.</p>
                    <p class="bold-span">2. Запрещенное использование Портала</p>
                    <p>2.1. Портал доступен только для Вашего личного некоммерческого использования.</p>
                    <p>2.2.1. Накапливать или собирать адреса электронной почты или другую контактную информацию пользователей Портала автоматизированными или иными способами для целей рассылки незапрошенной почты (спама) или другой нежелательной информации.</p>
                    <p>2.2.2. Использовать Портал любым способом, который может помешать нормальному функционированию Портала и его сервисов.</p>
                    <p>2.2.3. Использовать автоматизированные скрипты (программы) для сбора информации и(или) взаимодействия с Порталом и его сервисами.</p>
                    <p>2.2.4. Загружать, публиковать, передавать, иным образом доводить до всеобщего сведения (далее - размещать) любую информацию, которая содержит угрозы, дискредитирует или оскорбляет других пользователей или третьих лиц, является вульгарной, непристойной, носит мошеннический характер, посягает на личные или публичные интересы, пропагандирует расовую, религиозную, этническую ненависть или вражду, любую иную информацию, нарушающую охраняемые законом права человека и гражданина.</p>
                    <p>2.2.5. Вводить пользователей в заблуждение относительно своей личности, используя аккаунт другого человека, умышленно искажать представление о самом себе, своем возрасте или своих отношениях с другими лицами или организациями.</p>
                    <p>2.2.6. Размещать любую коммерческую рекламу, коммерческие предложения, агитационные материалы, распространять спам, сообщения-цепочки (сообщения, требующие их передачи одному или нескольким пользователям), схемы финансовых пирамид или призывы в них участвовать, любую другую навязчивую информацию, кроме случаев, когда размещение такой информации было одобрено Администрацией Портала.</p>
                    <p>2.2.7. Размещать на Портале домашние адреса, номера телефонов, адреса электронной почты, паспортные данные и прочую личную информацию других пользователей или любых третьих лиц без их личного согласия на такие действия.</p>
                    <p>2.2.8. Размещать любые файлы, которые содержат или могут содержать вирусы и другие вредоносные программы.</p>
                    <p>2.2.9. Описывать или пропагандировать преступную деятельность, размещать инструкции или руководства по совершению преступных действий.</p>
                    <p>2.2.10. Любым способом, в том числе путем взлома, пытаться получить доступ к чужому аккаунту вопреки воле лица, которому он принадлежит, к иным сведениям, хранящимся в базе данных Портала.</p>
                    <p>2.2.11. Размещать любую информацию, нарушающую исключительные права пользователей или третьих лиц на объекты интеллектуальной собственности.</p>
                    <p>2.2.12. Размещать любую другую информацию, которая, по личному мнению, Администрации Портала, является нежелательной, не соответствует целям создания Портала, ущемляет интересы пользователей или по другим причинам является нежелательной для размещения на Портале.</p>
                    <p>2.3. Администрация Портала оставляет за собой право по своему собственному усмотрению изменять (модерировать) или удалять любую публикуемую Вами информацию, нарушающую запреты, установленные п.2.2. Правил (включая личные сообщения). В случае нарушения п.2.2. Правил Администрация Портала оставляет за собой право приостанавливать, ограничивать или прекращать Ваш доступ ко всем или к любому из разделов или сервисов Портала в любое время по любой причине или без объяснения причин, с предварительным уведомлением или без такового, не отвечая за любой вред, который может быть причинен Вам таким действием.</p>
                    <p>2.4. Администрация Портала настоятельно закрепляет за собой право удалить Ваш аккаунт и(или) приостановить, ограничить или прекратить Ваш доступ к любому из сервисов Портала, если обнаружит, что, по ее мнению, Вы представляете угрозу для Портала и(или) его пользователей.</p>
                    <p class="bold-span">3. Исключительные права на Контент, размещенный на Портале</p>
                    <p>3.1. Все объекты, размещенные на Сайте, в том числе элементы дизайна, текст, графические изображения, иллюстрации, видео, скрипты, программы, музыка, звуки и другие объекты и их подборки (далее - Контент), являются объектами исключительных прав Администрации Портала и других правообладателей. Все права на эти объекты защищены.</p>
                    <p>3.2. В особых случаях Администрация Портала предоставляет право пользователям, зашедшим под ролью «Учитель», скачать в виде презентации или распечатать любое задание из Каталога Портала и использовать его в своей профессиональной деятельности.</p>
                    <p>3.3. Кроме случаев, установленных настоящими Правилами, а также действующим законодательством Республики Беларусь, никакой Контент не может быть скопирован (воспроизведен), переработан, распространен, отображен во фрейме, опубликован, скачан, передан, продан или иным способом использован целиком или по частям, без предварительного разрешения правообладателя, кроме случаев, когда правообладатель явным образом выразил свое согласие на свободное использование материала любым лицом.</p>
                    <p class="bold-span">4. Сайты и Контент третьих лиц</p>
                    <p>4.1. Портал содержит (или может содержать) ссылки на другие вебсайты (сайты третьих лиц) так же, как и статьи, фотографии, иллюстрации, графические изображения, музыку, звуки, видео, информацию, приложения, программы и другой Контент, принадлежащий или исходящий от третьих лиц (Контент третьих лиц).</p>
                    <p>4.2. Указанные третьи лица и их Контент не проверяются Администрацией Портала на соответствие тем или иным требованиям (достоверности, полноты, добросовестности и т.п.). Администрация Портала не несет ответственность за любую информацию, размещенную на сайтах третьих лиц, к которым вы получили доступ через Портал или через Контент третьих лиц, включая любые мнения или утверждения, выраженные на сайтах третьих лиц или в их Контенте.</p>
                    <p>4.3. Ссылка на любой Портал, продукт, услугу, любую информацию коммерческого или некоммерческого характера, размещенная на Портале, не является одобрением или рекомендацией данных продуктов (услуг) со стороны Администрации Портала.</p>
                    <p>4.4. Если Вы решили покинуть Портал и перейти к сайтам третьих лиц, использовать или установить Контент третьих лиц, Вы делаете это на свой риск и с этого момента настоящие Правила более не действуют. В Ваших дальнейших отношениях Вам стоит руководствоваться применимыми нормами и политикой, в том числе деловыми обычаями тех лиц, чей Контент Вы используете.</p>
                    <p class="bold-span">5. Ответственность пользователей и Администрации Портала</p>
                    <p>5.1. Вы несете личную ответственность за любую информацию, которую Вы сообщаете другим пользователям Портала и за Ваши взаимодействия с ними.</p>
                    <p>5.2. Портал или его сервисы могут быть в то или иное время частично либо полностью недоступны по причине проведения профилактических или иных работ, а также по любым другим причинам технического характера. Администрация Портала имеет право проводить необходимые профилактические или другие работы в то или иное время по личному усмотрению с предварительным уведомлением пользователей или без такового.</p>
                    <p>5.3. Администрация Портала не отвечает за любые технические сбои, иные проблемы любых телефонных сетей или служб, компьютерных систем, серверов или провайдеров, компьютерного или телефонного оборудования, программного обеспечения по техническим причинам.</p>
                    <p class="bold-span">6. Ограничение ответственности Администрации Портала</p>
                    <p>6.1. Администрация Портала сохраняет за собой право в любое время изменять оформление Портала, его Контент, список сервисов, тарифы на предоставляемые услуги; изменять или дополнять используемые скрипты, программное обеспечение и другие объекты, используемые или хранящиеся на Портале, любые серверные приложения в любое время с предварительным уведомлением или без такового.</p>
                    <p class="bold-span">7. Заключительные положения</p>
                    <p>7.1. Настоящие Правила составляют неотъемлемую часть соглашения между Вами и Администрацией Портала относительно порядка использования Портала и его сервисов. Соглашение вступает в силу с момента акцепта публичной оферты, происходящего при регистрации на Портале.</p>
                    <p>7.2. Настоящие Правила регулируются и толкуются в соответствии с законодательством Республики Беларусь. Вопросы, не урегулированные Правилами, подлежат разрешению в соответствии с законодательством Республики Беларусь.</p>
                    <p>7.3. Администрация Портала всегда готова принять к сведению пожелания и предложения любого участника сайта относительно работы ресурса.</p>
                </div>
            </transition>
        </div>
        <div>
            <div @click="showOrHideTenthInfo()">
                <span v-if="!tenthInfoShown" class="bold-span">+</span>
                <span v-if="tenthInfoShown" class="bold-span">-</span>
                <span class="bold-span">О платформе EFFOR.BY</span>
            </div>
            <transition name="slide-fade">
                <div v-if="tenthInfoShown" class="tenth-info-container">
                    <p>Разработчиком и владельцем проекта <span class="bold-span">EFFOR.BY</span> является ООО "Интеллект Онлайн" (г. Минск).</p>
                    <p><span class="bold-span">Юридический адрес</span> 220114, г.Минск, пр. Независимости, д.95, пом.12, каб.320</p>
                    <p><span class="bold-span">Почтовый адрес</span> 220089, Республика Беларусь, г.Минск, а/я 12</p>
                    <p><span class="bold-span">Наш e-mail</span> msm@effor.by</p>
                    <p><span class="bold-span">Телефон</span>: +375 33 670 84 19</p>
                </div>
            </transition>
        </div>
    </div>
</template>

<script>

export default {
    data() {
        return {
            firstInfoShown: false,
            secondInfoShown: false,
            thirdInfoShown: false,
            forthInfoShown: false,
            fifthInfoShown: false,
            sixthInfoShown: false,
            seventhInfoShown: false,
            eighthInfoShown: false,
            ninethInfoShown: false,
            tenthInfoShown: false,
        };
    },
    methods: {
        showOrHideFirstInfo() {
            this.firstInfoShown = !this.firstInfoShown;
        },
        showOrHideSecondInfo() {
            this.secondInfoShown = !this.secondInfoShown;
        },
        showOrHideThirdInfo() {
            this.thirdInfoShown = !this.thirdInfoShown;
        },
        showOrHideForthInfo() {
            this.forthInfoShown = !this.forthInfoShown;
        },
        showOrHideFifthInfo() {
            this.fifthInfoShown = !this.fifthInfoShown;
        },
        showOrHideSixthInfo() {
            this.sixthInfoShown = !this.sixthInfoShown;
        },
        showOrHideSeventhInfo() {
            this.seventhInfoShown = !this.seventhInfoShown;
        },
        showOrHideEighthInfo() {
            this.eighthInfoShown = !this.eighthInfoShown;
        },
        showOrHideNinethInfo() {
            this.ninethInfoShown = !this.ninethInfoShown;
        },
        showOrHideTenthInfo() {
            this.tenthInfoShown = !this.tenthInfoShown;
        }
    },
}
</script>

<style scoped>

a {
    text-decoration: none;
    color: blue;
}

.slide-fade-enter-active {
  transition: all .4s ease;
}
.slide-fade-leave-active {
  transition: all .3s cubic-bezier(1.0, 0.5, 0.8, 1.0);
}
.slide-fade-enter, .slide-fade-leave-to
/* .slide-fade-leave-active до версии 2.1.8 */ {
  transform: translateY(10px);
  opacity: 0;
}

.about-platform-container {
    width: 100%;
    display: flex;
    flex-direction: column;
    margin-top: 10px;
    color: #222222;
}

.about-platform-container > div > :first-child {
    cursor: pointer;
}

.about-platform-container > :nth-child(2) {
    margin-top: 20px;
}

.bold-span {
    font-weight: bold;
}

.first-info-container > p {
    text-indent: 1.5em;
    margin-top: 5px;
    margin-bottom: 5px;
}

.second-info-container > p {
    text-indent: 1.5em;
    margin-top: 5px;
    margin-bottom: 5px;
}

ul {
    margin-top: 0px;
    margin-bottom: 0px;
}

.third-info-container > p {
    text-indent: 1.5em;
    margin-top: 5px;
    margin-bottom: 5px;
}

.forth-info-container > p {
    text-indent: 1.5em;
    margin-top: 5px;
    margin-bottom: 5px;
}

.fifth-info-container > p {
    text-indent: 1.5em;
    margin-top: 5px;
    margin-bottom: 5px;
}

.sixth-info-container > p {
    text-indent: 1.5em;
    margin-top: 5px;
    margin-bottom: 5px;
}

.seventh-info-container > p {
    text-indent: 1.5em;
    margin-top: 5px;
    margin-bottom: 5px;
}

.eighth-info-container > p {
    text-indent: 1.5em;
    margin-top: 5px;
    margin-bottom: 5px;
}

.eighth-info-container > :nth-child(4) {
    margin-top: 20px;
}

.eighth-info-container > :last-child {
    margin-top: 20px;
}

.eighth-info-container > :last-child > p {
    text-indent: 1.5em;
    margin-top: 5px;
    margin-bottom: 5px;
}

.nineth-info-container > p {
    text-indent: 1.5em;
    margin-top: 5px;
    margin-bottom: 5px;
}

.nineth-info-container > :first-child {
    margin-top: 20px;
    margin-bottom: 20px;
}

.nineth-info-container > :nth-child(11) {
    margin-top: 20px;
}

.nineth-info-container > :nth-child(27) {
    margin-top: 20px;
}

.nineth-info-container > :nth-child(31) {
    margin-top: 20px;
}

.nineth-info-container > :nth-child(36) {
    margin-top: 20px;
}

.nineth-info-container > :nth-child(40) {
    margin-top: 20px;
}

.nineth-info-container > :nth-child(42) {
    margin-top: 20px;
}

.tenth-info-container > p {
    text-indent: 1.5em;
    margin-top: 5px;
    margin-bottom: 5px;
}


</style>
