const parallels = [
    {
        id: 0,
        number: 1,
        works: {
            'Математика': [
                {
                    name: 'Новая проверочная работа по математике 1 класс',
                    type: 'Контрольная',
                    taskCount: 10,
                    time: 30,
                    conducted: undefined,
                },
                {
                    name: 'Контрольный тест по математике 1 класс',
                    type: 'Контрольная',
                    taskCount: 1000,
                    time: 30000,
                    conducted: undefined,
                },
                {
                    name: 'Контрольная по математике 1 класс',
                    type: 'Контрольная',
                    taskCount: 1000,
                    time: 30000,
                    conducted: '01.02.2018',
                },
            ],
            'Русский язык': [],
            'Белорусский язык': [],
            'Информатика': [
                {
                    name: 'Тест по информатике 1 класс',
                    type: 'Контрольная',
                    taskCount: 1000,
                    time: 30000,
                    conducted: '01.02.2018',
                },
            ],
            'Физика': [
                {
                    name: 'Тест по физике 1 класс',
                    type: 'Контрольная',
                    taskCount: 300,
                    time: 1420,
                    conducted: undefined,
                },
            ],
            'Химия': [
                {
                    name: 'Тест по химии 1 класс',
                    type: 'Контрольная',
                    taskCount: 120,
                    time: 5420,
                    conducted: undefined,
                },
            ],
            'Астрономия': [],
            'Развитие': [
                {
                    name: 'Новая проверочная работа по развитию 1 класс',
                    type: 'Контрольная',
                    taskCount: 10,
                    time: 30,
                    conducted: undefined,
                },
                {
                    name: 'Контрольный тест по развитию 1 класс',
                    type: 'Контрольная',
                    taskCount: 1000,
                    time: 30000,
                    conducted: '15.04.2120',
                },
            ],
        },
    },
    {
        id: 1,
        number: 4,
        works: {
            'Математика': [
                {
                    name: 'Новая проверочная работа по математике 4 класс',
                    type: 'Контрольная',
                    taskCount: 10,
                    time: 30,
                    conducted: undefined,
                },
            ],
            'Русский язык': [],
            'Белорусский язык': [],
            'Информатика': [],
            'Физика': [],
            'Химия': [],
            'Астрономия': [],
            'Развитие': [
                {
                    name: 'Новая проверочная работа по развитию 4 класс',
                    type: 'Контрольная',
                    taskCount: 10,
                    time: 30,
                    conducted: undefined,
                },
                {
                    name: 'Контрольный тест по развитию 4 класс',
                    type: 'Контрольная',
                    taskCount: 1000,
                    time: 30000,
                    conducted: '15.04.2120',
                },
            ],
        },
    },
    {
        id: 2,
        number: 7,
        works: {
            'Математика': [],
            'Русский язык': [],
            'Белорусский язык': [],
            'Информатика': [],
            'Физика': [],
            'Химия': [],
            'Астрономия': [],
            'Развитие': [],
        },
    },
];

export default parallels;
